app/Controllers/Blog.php

SELECT `id`, `name`
FROM `categories`
ORDER BY `name` ASC
 LIMIT 3
---
    public function __construct()
    {
        $this->request = \Config\Services::request();
        $this->session = session();
        $this->db = db_connect();
        $this->auth_model = new Auth();
        $this->category_model = new Categories();
        $this->post_model = new Posts();

        $menu_cat = $this->category_model->select("id, name")
            ->orderBy('name', 'asc')
            ->limit(3)
            ->find();

SELECT COUNT(*) AS `numrows`
FROM `posts`
WHERE `status` = 1
SELECT *
FROM `posts`
WHERE `status` = 1
ORDER BY abs(unix_timestamp(created_at)) DESC
 LIMIT 5
---
    public function index()
    {
        $this->data['page_title'] = "Home";
        $this->data['page'] =  !empty($this->request->getVar('page')) ? $this->request->getVar('page') : 1;
        $this->data['perPage'] =  5;
        $this->data['total'] =  $this->post_model->where('status', 1)
            ->orderBy('abs(unix_timestamp(created_at)) DESC')
            ->countAllResults();
        $this->data['posts'] = $this->post_model->where('status', 1)
            ->orderBy('abs(unix_timestamp(created_at)) DESC')
            ->paginate($this->data['perPage']);