app/Controllers/Main.php

SELECT COUNT(*) AS `numrows` FROM `categories`
SELECT COUNT(*) AS `numrows`
FROM `users`
WHERE `type` = 2
SELECT COUNT(*) AS `numrows`
FROM `posts`
---
    public function index()
    {
        $this->data['page_title']="Home";
        $this->data['categories']=$this->category_model->countAll();
        if($this->session->login_type == 2){
            $this->post_model->where("posts.user_id = '{$this->session->login_id}' ");
        }
        $this->data['posts']=$this->post_model->countAllResults();

SELECT *
FROM `users`
WHERE `id` != '3'
 LIMIT 10
SELECT COUNT(*) AS `numrows`
FROM `users`
WHERE `id` != '3'
---
    public function users(){
        $this->data['page_title']="Users";
        $this->data['page'] =  !empty($this->request->getVar('page')) ? $this->request->getVar('page') : 1;
        $this->data['perPage'] =  10;
        $this->data['total'] =  $this->auth_model->where("id != '{$this->session->login_id}'")->countAllResults();
        $this->data['users'] = $this->auth_model->where("id != '{$this->session->login_id}'")->paginate($this->data['perPage']);

SELECT COUNT(*) AS `numrows`
FROM `categories`
SELECT *
FROM `categories`
 LIMIT 10
---
    public function categories(){
        $this->data['page_title']="Categories";
        $this->data['page'] =  !empty($this->request->getVar('page')) ? $this->request->getVar('page') : 1;
        $this->data['perPage'] =  10;
        $this->data['total'] =  $this->category_model->countAllResults();
        $this->data['categories'] = $this->category_model->paginate($this->data['perPage']);

SELECT COUNT(*) AS `numrows`
FROM `posts`
SELECT COUNT(*) AS `numrows`
FROM `posts`
INNER JOIN `users` ON `posts`.`user_id` = `users`.`id`
SELECT `posts`.*, `users`.`email` as `author`
FROM `posts`
INNER JOIN `users` ON `posts`.`user_id` = `users`.`id`
 LIMIT 10
---
    public function posts(){
        $this->data['page_title']="Posts";
        $this->data['page'] =  !empty($this->request->getVar('page')) ? $this->request->getVar('page') : 1;
        $this->data['perPage'] =  10;
        if($this->session->login_type == 2){
            $this->post_model->where("posts.user_id = '{$this->session->login_id}' ");
        }
        if(!empty($this->request->getVar('search'))){
            $search = $this->request->getVar('search');
            $this->post_model->where(" `posts`.title LIKE '%{$search}%' or `posts`.short_description LIKE '%{$search}%' or `posts`.content LIKE '%{$search}%' or `posts`.tags LIKE '%{$search}%' or `posts`.user_id in (SELECT id from users where email LIKE '%{$search}%') or category_id in (SELECT id FROM `categories` where name LIKE '%{$search}%') ");
        }
        $this->data['total'] =  $this->post_model->countAllResults();
        if(!empty($this->request->getVar('search'))){
            $search = $this->request->getVar('search');
            $this->post_model->where(" `posts`.title LIKE '%{$search}%' or `posts`.short_description LIKE '%{$search}%' or `posts`.content LIKE '%{$search}%' or `posts`.tags LIKE '%{$search}%' or `users`.email LIKE '%{$search}%' or category_id in (SELECT id FROM `categories` where name LIKE '%{$search}%') ");
        }
        if($this->session->login_type == 2){
            $this->post_model->where("posts.user_id = '{$this->session->login_id}' ");
        }
        $this->data['posts'] = $this->post_model
                                ->select("posts.*, users.email as author ")
                                ->join("users", "posts.user_id = users.id", 'inner')
                                ->paginate($this->data['perPage']);